import bigBook from "../images/bigBook.jpg"
import bigBookColored from "../images/bigBookColored.jpg"

export const books = [
    {
        id: '1',
        name: 'Грокаем алгоритмы. Иллюстрированное',
        author: 'Адитья Бхаргава, 2019',
        cover: false,
        photos: [],
        about: 'Алгоритмы — это всего лишь пошаговые алгоритмы решения задач, и большинство таких задач уже были кем-то решены, протестированы и проверены. Можно, конечно, погрузится в глубокую философию гениального Кнута, изучить многостраничные фолианты с доказательствами и обоснованиями, но хотите ли вы тратить на это свое время? Откройте великолепно иллюстрированную книгу и вы сразу поймете, что алгоритмы — это просто. А грокать алгоритмы — это веселое и увлекательное занятие.'
    },
    {
        id: '2',
        name: 'Грокаем алгоритмы. Иллюстрированное',
        author: 'Адитья Бхаргава, 2019',
        cover: true,
        photos: [bigBook],
        about: 'Алгоритмы — это всего лишь пошаговые алгоритмы решения задач, и большинство таких задач уже были кем-то решены, протестированы и проверены. Можно, конечно, погрузится в глубокую философию гениального Кнута, изучить многостраничные фолианты с доказательствами и обоснованиями, но хотите ли вы тратить на это свое время? Откройте великолепно иллюстрированную книгу и вы сразу поймете, что алгоритмы — это просто. А грокать алгоритмы — это веселое и увлекательное занятие.'
    },
    {
        id: '3',
        name: 'Грокаем алгоритмы. Иллюстрированное',
        author: 'Адитья Бхаргава, 2019',
        cover: true,
        photos: [bigBook, bigBookColored, bigBook, bigBookColored, bigBookColored, bigBook, bigBookColored],
        about: 'Алгоритмы — это всего лишь пошаговые алгоритмы решения задач, и большинство таких задач уже были кем-то решены, протестированы и проверены. Можно, конечно, погрузится в глубокую философию гениального Кнута, изучить многостраничные фолианты с доказательствами и обоснованиями, но хотите ли вы тратить на это свое время? Откройте великолепно иллюстрированную книгу и вы сразу поймете, что алгоритмы — это просто. А грокать алгоритмы — это веселое и увлекательное занятие.'
    },
    {
        id: '4',
        name: 'Грокаем алгоритмы. Иллюстрированное',
        author: 'Адитья Бхаргава, 2019',
        cover: true,
        photos: [bigBook, bigBook, bigBook, bigBook, bigBook, bigBook, bigBook],
        about: 'Алгоритмы — это всего лишь пошаговые алгоритмы решения задач, и большинство таких задач уже были кем-то решены, протестированы и проверены. Можно, конечно, погрузится в глубокую философию гениального Кнута, изучить многостраничные фолианты с доказательствами и обоснованиями, но хотите ли вы тратить на это свое время? Откройте великолепно иллюстрированную книгу и вы сразу поймете, что алгоритмы — это просто. А грокать алгоритмы — это веселое и увлекательное занятие.'
    },
    {
        id: '5',
        name: 'Грокаем алгоритмы. Иллюстрированное',
        author: 'Адитья Бхаргава, 2019',
        cover: false,
        photos: [bigBook, bigBook, bigBook, bigBook, bigBook, bigBook, bigBook],
        about: 'Алгоритмы — это всего лишь пошаговые алгоритмы решения задач, и большинство таких задач уже были кем-то решены, протестированы и проверены. Можно, конечно, погрузится в глубокую философию гениального Кнута, изучить многостраничные фолианты с доказательствами и обоснованиями, но хотите ли вы тратить на это свое время? Откройте великолепно иллюстрированную книгу и вы сразу поймете, что алгоритмы — это просто. А грокать алгоритмы — это веселое и увлекательное занятие.'
    },
    {
        id: '6',
        name: 'Грокаем алгоритмы. Иллюстрированное пособие для программистов и любопытствующих',
        author: 'Адитья Бхаргава, 2019',
        cover: true,
        photos: [bigBook, bigBook, bigBook, bigBook, bigBook, bigBook, bigBook],
        about: 'Алгоритмы — это всего лишь пошаговые алгоритмы решения задач, и большинство таких задач уже были кем-то решены, протестированы и проверены. Можно, конечно, погрузится в глубокую философию гениального Кнута, изучить многостраничные фолианты с доказательствами и обоснованиями, но хотите ли вы тратить на это свое время? Откройте великолепно иллюстрированную книгу и вы сразу поймете, что алгоритмы — это просто. А грокать алгоритмы — это веселое и увлекательное занятие.'
    },
    {
        id: '7',
        name: 'Грокаем алгоритмы. Иллюстрированное',
        author: 'Адитья Бхаргава, 2019',
        cover: true,
        photos: [bigBook, bigBook, bigBook, bigBook, bigBook, bigBook, bigBook],
        about: 'Алгоритмы — это всего лишь пошаговые алгоритмы решения задач, и большинство таких задач уже были кем-то решены, протестированы и проверены. Можно, конечно, погрузится в глубокую философию гениального Кнута, изучить многостраничные фолианты с доказательствами и обоснованиями, но хотите ли вы тратить на это свое время? Откройте великолепно иллюстрированную книгу и вы сразу поймете, что алгоритмы — это просто. А грокать алгоритмы — это веселое и увлекательное занятие.'
    },
    {
        id: '8',
        name: 'Грокаем алгоритмы. Иллюстрированное',
        author: 'Адитья Бхаргава, 2019',
        cover: true,
        photos: [bigBook, bigBook, bigBook, bigBook, bigBook, bigBook, bigBook],
        about: 'Алгоритмы — это всего лишь пошаговые алгоритмы решения задач, и большинство таких задач уже были кем-то решены, протестированы и проверены. Можно, конечно, погрузится в глубокую философию гениального Кнута, изучить многостраничные фолианты с доказательствами и обоснованиями, но хотите ли вы тратить на это свое время? Откройте великолепно иллюстрированную книгу и вы сразу поймете, что алгоритмы — это просто. А грокать алгоритмы — это веселое и увлекательное занятие.'
    },
]

export const allBooks = [
    {
        issueYear: "2019",
        rating: 3,
        title: "Построение бизнес-моделей: Настольная книга стратега и новатора",
        authors: [
            "Александр Остервальдер"
        ],
        image: {
            url: "/uploads/10209755_0_Postroenie_biznes_modeley_Nastolnaya_kniga_stratega_i_novatora_Aleksandr_Ostervalder_Iv_Pine_931aabe20f.jpg"
        },
        categories: [
            "Бизнес"
        ],
        id: 2,
        booking: null,
        delivery: null,
        histories: null
    },
    {
        issueYear: "2018",
        rating: null,
        title: "Разработка ценностных предложений: Как создавать товары и услуги, которые захотят купить потребители",
        authors: [
            "Александр Остервальдер"
        ],
        image: {
            url: "/uploads/10442229_0_5d1c5827e4.jpg"
        },
        categories: [
            "Бизнес"
        ],
        id: 3,
        booking: {
            id: 130,
            order: true,
            dateOrder: "2023-01-24T13:31:42.192Z",
            customerId: 5,
            customerFirstName: "Дарья",
            customerLastName: "Бичан"
        },
        delivery: null,
        histories: [
            {
                id: 60,
                userId: 5
            }
        ]
    },
]
