import bigBook from "../images/bigBook.jpg"
import bigBookColored from "../images/bigBookColored.jpg"

export const books = [
    {
        id: '1',
        name: 'Грокаем алгоритмы. Иллюстрированное',
        author: 'Адитья Бхаргава, 2019',
        cover: false,
        photos: [],
        about: 'Алгоритмы — это всего лишь пошаговые алгоритмы решения задач, и большинство таких задач уже были кем-то решены, протестированы и проверены. Можно, конечно, погрузится в глубокую философию гениального Кнута, изучить многостраничные фолианты с доказательствами и обоснованиями, но хотите ли вы тратить на это свое время? Откройте великолепно иллюстрированную книгу и вы сразу поймете, что алгоритмы — это просто. А грокать алгоритмы — это веселое и увлекательное занятие.'
    },
    {
        id: '2',
        name: 'Грокаем алгоритмы. Иллюстрированное',
        author: 'Адитья Бхаргава, 2019',
        cover: true,
        photos: [bigBook],
        about: 'Алгоритмы — это всего лишь пошаговые алгоритмы решения задач, и большинство таких задач уже были кем-то решены, протестированы и проверены. Можно, конечно, погрузится в глубокую философию гениального Кнута, изучить многостраничные фолианты с доказательствами и обоснованиями, но хотите ли вы тратить на это свое время? Откройте великолепно иллюстрированную книгу и вы сразу поймете, что алгоритмы — это просто. А грокать алгоритмы — это веселое и увлекательное занятие.'
    },
    {
        id: '3',
        name: 'Грокаем алгоритмы. Иллюстрированное',
        author: 'Адитья Бхаргава, 2019',
        cover: true,
        photos: [bigBook, bigBookColored, bigBook, bigBookColored, bigBookColored, bigBook, bigBookColored],
        about: 'Алгоритмы — это всего лишь пошаговые алгоритмы решения задач, и большинство таких задач уже были кем-то решены, протестированы и проверены. Можно, конечно, погрузится в глубокую философию гениального Кнута, изучить многостраничные фолианты с доказательствами и обоснованиями, но хотите ли вы тратить на это свое время? Откройте великолепно иллюстрированную книгу и вы сразу поймете, что алгоритмы — это просто. А грокать алгоритмы — это веселое и увлекательное занятие.'
    },
    {
        id: '4',
        name: 'Грокаем алгоритмы. Иллюстрированное',
        author: 'Адитья Бхаргава, 2019',
        cover: true,
        photos: [bigBook, bigBook, bigBook, bigBook, bigBook, bigBook, bigBook],
        about: 'Алгоритмы — это всего лишь пошаговые алгоритмы решения задач, и большинство таких задач уже были кем-то решены, протестированы и проверены. Можно, конечно, погрузится в глубокую философию гениального Кнута, изучить многостраничные фолианты с доказательствами и обоснованиями, но хотите ли вы тратить на это свое время? Откройте великолепно иллюстрированную книгу и вы сразу поймете, что алгоритмы — это просто. А грокать алгоритмы — это веселое и увлекательное занятие.'
    },
    {
        id: '5',
        name: 'Грокаем алгоритмы. Иллюстрированное',
        author: 'Адитья Бхаргава, 2019',
        cover: false,
        photos: [bigBook, bigBook, bigBook, bigBook, bigBook, bigBook, bigBook],
        about: 'Алгоритмы — это всего лишь пошаговые алгоритмы решения задач, и большинство таких задач уже были кем-то решены, протестированы и проверены. Можно, конечно, погрузится в глубокую философию гениального Кнута, изучить многостраничные фолианты с доказательствами и обоснованиями, но хотите ли вы тратить на это свое время? Откройте великолепно иллюстрированную книгу и вы сразу поймете, что алгоритмы — это просто. А грокать алгоритмы — это веселое и увлекательное занятие.'
    },
    {
        id: '6',
        name: 'Грокаем алгоритмы. Иллюстрированное пособие для программистов и любопытствующих',
        author: 'Адитья Бхаргава, 2019',
        cover: true,
        photos: [bigBook, bigBook, bigBook, bigBook, bigBook, bigBook, bigBook],
        about: 'Алгоритмы — это всего лишь пошаговые алгоритмы решения задач, и большинство таких задач уже были кем-то решены, протестированы и проверены. Можно, конечно, погрузится в глубокую философию гениального Кнута, изучить многостраничные фолианты с доказательствами и обоснованиями, но хотите ли вы тратить на это свое время? Откройте великолепно иллюстрированную книгу и вы сразу поймете, что алгоритмы — это просто. А грокать алгоритмы — это веселое и увлекательное занятие.'
    },
    {
        id: '7',
        name: 'Грокаем алгоритмы. Иллюстрированное',
        author: 'Адитья Бхаргава, 2019',
        cover: true,
        photos: [bigBook, bigBook, bigBook, bigBook, bigBook, bigBook, bigBook],
        about: 'Алгоритмы — это всего лишь пошаговые алгоритмы решения задач, и большинство таких задач уже были кем-то решены, протестированы и проверены. Можно, конечно, погрузится в глубокую философию гениального Кнута, изучить многостраничные фолианты с доказательствами и обоснованиями, но хотите ли вы тратить на это свое время? Откройте великолепно иллюстрированную книгу и вы сразу поймете, что алгоритмы — это просто. А грокать алгоритмы — это веселое и увлекательное занятие.'
    },
    {
        id: '8',
        name: 'Грокаем алгоритмы. Иллюстрированное',
        author: 'Адитья Бхаргава, 2019',
        cover: true,
        photos: [bigBook, bigBook, bigBook, bigBook, bigBook, bigBook, bigBook],
        about: 'Алгоритмы — это всего лишь пошаговые алгоритмы решения задач, и большинство таких задач уже были кем-то решены, протестированы и проверены. Можно, конечно, погрузится в глубокую философию гениального Кнута, изучить многостраничные фолианты с доказательствами и обоснованиями, но хотите ли вы тратить на это свое время? Откройте великолепно иллюстрированную книгу и вы сразу поймете, что алгоритмы — это просто. А грокать алгоритмы — это веселое и увлекательное занятие.'
    },
]
